import { data } from "./word";
import { collect } from "collect.js";
import { match } from "ts-pattern";
import { PaliToken } from "./pali";

let collection = collect(data);

// prettier-ignore
collection = collection.merge([
  ...new PaliToken("ต", { tags: ["สรรพนาม"], info: ['ท่าน/เขา/มัน', '/he/she/it'] }).map((ori) =>
    [ori].concat(
      ori
      .mut_update({ gender: "ปุ" })
      .create_full_vipatti_str`
        โส. เต.                 ตํ นํ.       เต เน.
        เตน. เตหิ.               ตสฺส อสฺส.  เตสํ เตสานํ เนสํ เนสานํ.
        ตสฺมา อสฺมา ตมฺหา. เตหิ.   ตสฺส อสฺส. เตสํ เตสานํ เนสํ เนสานํ.
        ตสฺมิํ อสฺมิํ ตมฺหิ.     เตสุ.
      `,
      ori
      .mut_update({ gender: "นปุ" })
      .create_full_vipatti_str`
        ตํ. ตานิ.                 ตํ นํ.       ตานิ.
        เตน. เตหิ.               ตสฺส อสฺส.  เตสํ เตสานํ เนสํ เนสานํ.
        ตสฺมา อสฺมา ตมฺหา. เตหิ.   ตสฺส อสฺส. เตสํ เตสานํ เนสํ เนสานํ.
        ตสฺมิํ อสฺมิํ ตมฺหิ.     เตสุ.
      `,
      ori
      .mut_update({ gender: "อิต" })
      .create_full_vipatti_str`
        สา.    ตา.    ตํ นํ.                      ตา.
        ตาย.   ตาหิ.   ตสฺสา อสฺสา ติสฺสา ติสฺสาย.  ตาสํ ตาสานํ.
        ตาย.   ตาหิ.   ตสฺสา อสฺสา ติสฺสา ติสฺสาย.  ตาสํ ตาสานํ.
        ตายํ ตสฺสํ อสฺสํ ติสฺสํ.     ตาสุ.
      `
    )
  ),
  // TODO
  ...new PaliToken("ตุมฺห", { gender: 'ปุ', tags: ["สรรพนาม"], info: ['ท่าน'] }).map((ori) => [ori]), 
  ...new PaliToken("ตุมฺห", { gender: 'อิต', tags: ["สรรพนาม"], info: ['ท่าน'] }).map((ori) => [ori]), 
  // TODO
  ...new PaliToken("อมฺห", { gender: 'ปุ', tags: ["สรรพนาม"], info: ['เรา'] }).map((ori) => [ori]), 
  ...new PaliToken("อมฺห", { gender: 'อิต', tags: ["สรรพนาม"], info: ['เรา'] }).map((ori) => [ori]), 
]);

const two = collection
  .filter((it) => it.tags.includes("ลิงค์"))
  .where("gender", "ปุ")
  .flatMap((it) => {
    return match([it.gender, it.stems_end])
      .with(
        ["ปุ", "อะ"],
        () => it.create_full_vipatti_str`
        โ-.             -า.        -ํ.            เ-.   
        เ-น.            เ-หิ เ-ภิ.  -สฺส -าย -ตฺถํ. -านํ.
        -สฺมา -มฺหา -า.  เ-หิ เ-ภิ.  -สฺส.          -านํ. 
        -สฺมิํ -มฺหิ         เ-. เ-สุ.  -.             -า.`
      )
      .with(
        ["ปุ", "อิ"],
        () => it.create_full_vipatti_str`
        -ิ.           -โย -ี.    -ิํ.        -โย -ี.
        -ินา.         -ีหิ -ีภิ.   -ิสฺส -ิโน.  -ีนํ. 
        -ิสฺมา -ิมฺหา.  -ีหิ -ีภิ.   -ิสฺส -ิโน.  -ีนํ. 
        -ิสฺมิํ -ิมฺหิ.     -ีสุ.      -ิ.         -โย -ี.
      `
      )
      .with(
        ["ปุ", "อี"],
        () => it.create_full_vipatti_str`
        -ี;                  -ิโน, -ี;
        -ิํ, -ินํ;              -โน, -ี;
        -ินา;                -ีหิ, -ีภิ;
        -ิสฺส, -ิโน;           -ีนํ; 
        -ิสฺมา, -ิมฺหา;        -ีหิ, -ีภิ;
        -ิสฺส, -ิโน;           -ีนํ; 
        -ิสฺมิํ, -ิมฺหิ;           -ีสุ;
        -ิ;                   -โน, -ี;
      `
      )
      .with(
        ["ปุ", "อุ"],
        () => it.create_full_vipatti_str`
        -ุ;                  -โว, -ู;
        -ุํ;                  -โว, -ู;
        -ุนา;                -ูหิ, -ูภิ;
        -ุสฺส, -ุโน;           -ูนํ; 
        -ุสฺมา, -ุมฺหา;        -ูหิ, -ูภิ;
        -ุสฺส, -ุโน;           -ูนํ; 
        -ุสฺมิํ, -ุมฺหิ;           -ูสุ;
        -ุ;                   -เว, -โว;
      `
      )
      .with(
        ["ปุ", "อู"],
        () => it.create_full_vipatti_str`
        -ู;                  -ุโน, -ู;
        -ุํ;                  -ุโน, -ู;
        -ุนา;                -ูหิ, -ูภิ;
        -ุสฺส, -ุโน;           -ูนํ; 
        -ุสฺมา, -ุมฺหา;        -ูหิ, -ูภิ;
        -ุสฺส, -ุโน;           -ูนํ; 
        -ุสฺมิํ, -ุมฺหิ;           -ูสุ;
        -ุ;                   -ุโน, -ู;
      `
      )
      .with(
        ["นปุ", "อะ"],
        () => it.create_full_vipatti_str`
        -ํ;                 -านิ;
        -ํ;                  -านิ;
        เ-น;                เ-หิ, เ-ภิ;
        -สฺส, -าย, -ตฺถํ;     -านํ;
        -สฺมา, -มฺหา, -า;   เ-หิ, เ-ภิ;
        -สฺส;                -านํ;
        -สฺมิํ, -มฺหิ, เ-;      เ-สุ;
        -;                  -านิ;
      `
      )
      .with(
        ["นปุ", "อิ"],
        () => it.create_full_vipatti_str`
        -ิ;                  -ีนิ, -ี;
        -ิํ;                  -ีนิ, -ี;
        -ินา;                -ีหิ, -ีภิ;
        -ิสฺส, -ิโน;           -ีนํ; 
        -ิสฺมา, -ิมฺหา;        -ีหิ, -ีภิ;
        -ิสฺส, -ิโน;           -ีนํ; 
        -ิสฺมิํ, -ิมฺหิ;           -ีสุ;
        -ิ;                   -ีนิ, -ี;
      `
      )
      .with(
        ["นปุ", "อุ"],
        () => it.create_full_vipatti_str`
        -ุ;                  -ูนิ, -ู;
        -ุํ;                  -นิ, -ู;
        -ุนา;                -ูหิ, -ูภิ;
        -ุสฺส, -ุโน;           -ูนํ; 
        -ุสฺมา, -ุมฺหา;        -ูหิ, -ูภิ;
        -ุสฺส, -ุโน;           -ูนํ; 
        -ุสฺมิํ, -ุมฺหิ;           -ูสุ;
        -ุ;                   -ูนิ, -ู;
      `
      )
      .with(
        ["อิต", "อา"],
        () => it.create_full_vipatti_str`
        -า;                 -าโย, -า;
        -ํ;                  -าโย, -า;
        -าย;                -าหิ, -าภิ;
        -าย;                -านํ;
        -าย;                -าหิ, -าภิ;
        -าย;                -านํ;
        -าย, -ายํ;           -าสุ;
        เ-;                 -าโย, -า;
      `
      )
      .with(
        ["อิต", "อิ"],
        () => it.create_full_vipatti_str`
        -ิ;                 -ิโย, -ี;
        -ิํ;                  -ิโย, -ี;
        -ิยา;                -ีหิ, -ีภิ;
        -ิยา;                -ีนํ;
        -ิยา;                -ีหิ, -ีภิ;
        -ิยา;                -ีนํ;
        -ิยา, -ิยํ;           -ีสุ;
        -ิ;                 -ิโย, -ี;
      `
      )
      .with(
        ["อิต", "อี"],
        () => it.create_full_vipatti_str`
        -ี;                 -ิโย, -ี;
        -ิํ, -ิยํ;             -ิโย, -ี;
        -ิยา;                -ีหิ, -ีภิ;
        -ิยา;                -ีนํ;
        -ิยา;                -ีหิ, -ีภิ;
        -ิยา;                -ีนํ;
        -ิยา, -ิยํ;           -ีสุ;
        -ิ;                 -ิโย, -ี;
      `
      )
      .with(
        ["อิต", "อุ"],
        () => it.create_full_vipatti_str`
        -ุ;                 -ุโย, -ู;
        -ุํ;                  -ุโย, -ู;
        -ุยา;                -ูหิ, -ูภิ;
        -ุยา;                -ูนํ;
        -ุยา;                -ูหิ, -ูภิ;
        -ุยา;                -ูนํ;
        -ุยา, -ุยํ;           -ูสุ;
        -ุ;                 -ุโย, -ู;
      `
      )
      .with(
        ["อิต", "อู"],
        () => it.create_full_vipatti_str`
        -ู;                 -ุโย, -ู;
        -ุํ;                  -ุโย, -ู;
        -ุยา;                -ูหิ, -ูภิ;
        -ุยา;                -ูนํ;
        -ุยา;                -ูหิ, -ูภิ;
        -ุยา;                -ูนํ;
        -ุยา;               -ูสุ, -ุยํ;
        -ุ;                 -ุโย, -ู;
      `
      )
      .run();
  });

console.log(collection.all().map((i) => i.toString()));
